Enums/ВидыСкидок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>ВидыСкидок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Абсолютная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Относительная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗадаетсяВДокументе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АбсолютнаяОтСтоимостиВО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Комплексная</Name>
					<Comment>Состоящая из простых/комплексных скидок</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ТипыСкидок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Catalog>
		<Properties>
			<Name>ТипыСкидок</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РазмерСкидки</Name>
					<Comment>Размер скидки в % или аболютном выражении</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСкидки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСкидок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Индивидуальная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БезУчетаСтоимостиОтделки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Скидка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыСкидок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ОтчетыCRMВызовСервера/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Подсистема "Отчеты CRM" (вызов сервера).
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// См. описание процедуры ОтчетыCRM.ДобавитьОтчетВИсторию()
Процедура ДобавитьОтчетВИсторию(Вариант) Экспорт
	
	ОтчетыCRM.ДобавитьОтчетВИсторию(Вариант);
	
КонецПроцедуры

//++ Юкаев Роман 20171218 (
Функция РассчитатьСкидку(Стоимость, ЦенаОтделкиКвМ, Площадь, Скидка) Экспорт
	
	Если Скидка = Справочники.ТипыСкидок.ПустаяСсылка() Тогда
		Возврат 0;
	Иначе
		ВидСкидки = Скидка.ВидСкидки;
		Если ВидСкидки = Перечисления.ВидыСкидок.Абсолютная Тогда
			Если Площадь = 0 Тогда
				Возврат 0;
			Иначе
				Если Скидка.РазмерСкидки < Стоимость / Площадь Тогда
					Возврат Скидка.РазмерСкидки * Площадь;
				Иначе
					Возврат 0;
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли ВидСкидки = Перечисления.ВидыСкидок.АбсолютнаяОтСтоимостиВО Тогда
			Если Площадь = 0 ИЛИ Скидка.РазмерСкидки > Стоимость Тогда
				Возврат 0;
			Иначе
				Возврат Скидка.РазмерСкидки;
			КонецЕсли;
		ИначеЕсли ВидСкидки = Перечисления.ВидыСкидок.Относительная Тогда
			Если Скидка.БезУчетаСтоимостиОтделки Тогда
				Возврат (Стоимость - ЦенаОтделкиКвМ * Площадь) * Скидка.РазмерСкидки / 100;
			Иначе
				Возврат Стоимость * Скидка.РазмерСкидки / 100
			КонецЕсли;
		ИначеЕсли ВидСкидки = Перечисления.ВидыСкидок.Комплексная Тогда
			
			СуммаСкидки = 0;
			РасчетнаяСтоимость = Стоимость;
			
			Для Каждого ЭлементСкидка Из Скидка.Состав Цикл
				РазмерСкидки = РассчитатьСкидку(РасчетнаяСтоимость, ЦенаОтделкиКвМ, Площадь, ЭлементСкидка.Скидка);
				Если РазмерСкидки = 0 Тогда
					Прервать;
				Иначе
					РасчетнаяСтоимость = РасчетнаяСтоимость - РазмерСкидки;
					СуммаСкидки = СуммаСкидки + РазмерСкидки;
				КонецЕсли;
			КонецЦикла;
			
			Возврат СуммаСкидки;
		Иначе
			Возврат 0;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции
//-- Юкаев Роман 20171218 )
#КонецОбласти
